app/controllers/login_controller.rb

  def auth
    usr = User.find_by(username: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "yyamada"], ["LIMIT", 1]]